app/Models/ModelsMenu.php

SELECT *
FROM `menu`
---
    public function getMenu()
    {
        return $this->findAll();