app/Models/ModelsHome.php

SELECT *
FROM `home`
---
    public function getHome()
    {
        return $this->findAll();